{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing implemented Android build features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries for various frontend source files.",
  "frontend/ANDROID.md": "Guide explaining prerequisites and steps for building the Android APK using Capacitor and Android Studio.",
  "frontend/android/.gitignore": "Ignore rules for Android build outputs, IDE files, logs, keystores, and generated directories.",
  "frontend/android/README.md": "Notes that the Android project is generated by Capacitor and warns against manual edits except when necessary.",
  "frontend/capacitor.config.ts": "Capacitor config defining app ID, name, web output directory, and Android scheme settings.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions setting dark horror‑themed color palettes and base styles.",
  "frontend/index.html": "Base HTML template loading the React app entrypoint and defining metadata and root mount element.",
  "frontend/src/App.tsx": "Main React component initializing the 3D scene, physics, UI overlays, touch controls, and theme provider.",
  "frontend/src/components/ControlsSettingsPanel.tsx": "Slide‑out settings panel allowing users to toggle mobile controls and adjust touch sensitivity.",
  "frontend/src/components/Elberr.tsx": "3D model and idle animation of the E.L.B.E.R.R. robot using Cannon physics and Three.js primitives.",
  "frontend/src/components/GameUI.tsx": "Static HUD showing crosshair, title, and pointer‑lock instructions.",
  "frontend/src/components/Player.tsx": "First‑person player controller handling physics movement, camera rotation, crouch height, and sprinting.",
  "frontend/src/components/Workshop.tsx": "Creates a 3D workshop scene with a floor and four static physics walls using react-three and cannon.",
  "frontend/src/controls/touch/MobileActionButtons.tsx": "Defines touch action buttons that trigger interact, sprint, and crouch actions through a touch input bridge.",
  "frontend/src/controls/touch/MobileTouchControlsOverlay.tsx": "Displays the mobile controls overlay including joystick, look area, and action buttons when enabled in settings.",
  "frontend/src/controls/touch/TouchLookArea.tsx": "Implements a touch-based look control area that reports pointer movement deltas scaled by sensitivity.",
  "frontend/src/controls/touch/VirtualJoystick.tsx": "Provides a touch joystick that outputs normalized movement values via the touch input bridge.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook returning an empty queries object.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables for theming and layout, including full-screen canvas styling.",
  "frontend/src/input/keyboardMouseInput.ts": "Captures keyboard and mouse movement to produce normalized movement, look deltas, and action states.",
  "frontend/src/input/touchInput.ts": "Implements touch input handling with setters for movement, look, and actions returning normalized input.",
  "frontend/src/input/touchInputBridge.ts": "Provides a global bridge to forward movement, look, and action updates to the current touch input handler.",
  "frontend/src/input/types.ts": "Defines normalized input structures and the InputSource interface.",
  "frontend/src/input/useUnifiedInput.ts": "Combines keyboard/mouse and touch input into a single normalized control object and resets input on visibility change.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and mounts it to the root element.",
  "frontend/src/settings/controlsSettings.ts": "Loads and saves control-related settings to localStorage with defaults for mobile detection and touch sensitivity.",
  "frontend/src/settings/useControlsSettings.ts": "React hook that manages control settings state and persists updates to localStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling typography, container queries, and animation plugins.",
  "frontend/vite.config.ts": "Vite config enabling React plugin, path aliasing, and custom build output settings.",
  "project_state.json": "Metadata file describing the project state, features, and versioning for the E.L.B.E.R.R. project."
}